<!doctype html>
<html>
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="chrome=1">
    <title>Lausanne Citation Style</title>
    <link rel="stylesheet" href="stylesheets/styles.css">
    <link rel="stylesheet" href="stylesheets/github-light.css">
    <meta name="viewport" content="width=device-width">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <!--[if lt IE 9]>
    <script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script>
    <![endif]-->
  </head>
  <body>
    <div class="wrapper">
      <header>
        <p style="text-align:center;"><img src="https://raw.githubusercontent.com/LausanneCitationStyle/Support/master/media/lausannelogo.png" alt="Lausanne citation style" style="width:200px;">
          <br><b>Style bibliographique</b><br>et intégration à Zotero</p>
        <table style="width:100%">
          <tr>
            <td><i class="material-icons">menu</i></td>
          </tr>
          <tr>
            <td><b><a href="https://lausannecitationstyle.github.io/support/">ACCUEIL</a></b></td>
          </tr>
          <tr>
            <td>STYLE BIBLIOGRAPHIQUE</td>
          </tr>
          <tr>
           <td>&nbsp;&nbsp;&nbsp;<a href="https://lausannecitationstyle.github.io/support/style-lausanne.html">Le style "Lausanne"</a><br>
             &nbsp;&nbsp;&nbsp;<small>Description, guide bibliographique.</small></td>
          </tr>
           <tr>
            <td>&nbsp;&nbsp;&nbsp;<a href="https://lausannecitationstyle.github.io/support/lausanne-zotero.html">Usage du style avec Zotero</a><br>
             &nbsp;&nbsp;&nbsp;<small>Installation, limites, ajustements.</small></td>
          </tr>
          <tr>
            <td>TUTORIEL ZOTERO</td>
          </tr>
           <tr>
            <td>&nbsp;&nbsp;&nbsp;<a href="https://lausannecitationstyle.github.io/support/1.html">Mise en place</a><br>
             &nbsp;&nbsp;&nbsp;<small>Installation, interface, synchronisation.</small></td>
          </tr>
          <tr>
            <td>&nbsp;&nbsp;&nbsp;<a href="https://lausannecitationstyle.github.io/support/2.html">Import des références</a><br>
            &nbsp;&nbsp;&nbsp;<small>Champs, PDF, import automatique.</small></td>
          </tr>
          <tr>
            <td>&nbsp;&nbsp;&nbsp;<a href="https://lausannecitationstyle.github.io/support/3.html">Gestion des références</a><br>
            &nbsp;&nbsp;&nbsp;<small>Collections, marqueurs, notes, groupes.</small></td>
          </tr>
           <tr>
            <td>&nbsp;&nbsp;&nbsp;<a href="https://lausannecitationstyle.github.io/support/4.html">Usage des références</a><br>
             &nbsp;&nbsp;&nbsp;<small>Export, notes de bas de pages.</small></td>
          </tr>
        </table>
        <img src="https://raw.githubusercontent.com/maladesimaginaires/intnetviz/master/img/logo_unil.png" alt="UNIL" style="width:150px;">  
        <p><small>Section d'histoire</small></p>
      </header>
      <section>
        <h1>USAGE DU STYLE "LAUSANNE" AVEC ZOTERO</h1>
        <h2>Installation</h2>
<p>L&rsquo;installation du style dans Zotero peut se faire sans quitter l&rsquo;application. Il faut se rendre dans les <strong>Pr&eacute;f&eacute;rences</strong> du logiciel et cliquer sur le menu<strong>&nbsp;Citer</strong>. Celui-ci affiche dans le <strong>Gestionnaire de styles</strong> tous les styles bibliographiques d&eacute;j&agrave; install&eacute;s. Il faut donc cliquer sur <strong>Obtenir d&rsquo;autres styles</strong> (lien au-dessous de la liste) pour afficher le catalogue complet des (plus de 9000) styles d&eacute;velopp&eacute;s pour Zotero. Dans ce catalogue, chercher &laquo; Lausanne &raquo; dans le moteur de recherche et cliquer sur le style &laquo; <strong>Universit&eacute; de Lausanne - Histoire</strong> &raquo; pour l&rsquo;installer.</p>
<h2>Utilisation</h2>
<p>Le style s&rsquo;utilise principalement dans deux situations :</p>
<p><b>Depuis Zotero lorsque l&rsquo;on veut exporter une liste de r&eacute;f&eacute;rences</b>
  <br>Une fois les r&eacute;f&eacute;rences s&eacute;lectionn&eacute;es, un clic droit ouvre une bo&icirc;te de dialogue dans laquelle il faut s&eacute;lectionner <strong>Cr&eacute;er une bibliographie &agrave; partir des &eacute;l&eacute;ments</strong>. Dans le menu qui s&rsquo;ouvre alors, choisir le style &laquo; Universit&eacute; de Lausanne - Histoire &raquo; dans la liste propos&eacute;e. La bibliographie est ainsi <strong>copi&eacute;e dans le presse-papier&nbsp;</strong>et peut &ecirc;tre coll&eacute;e dans un document de traitement de texte.</p>
<p><b>Depuis le traitement de texte lorsque l&rsquo;on veut ins&eacute;rer une citation</b><br>
  Dans le menu <strong>Zotero</strong>, lorsque l&rsquo;on clique sur <strong>Add/Edit Citation</strong>, la liste des styles install&eacute;s appara&icirc;t. Il suffit de choisir &laquo; Universit&eacute; de Lausanne &ndash; Histoire &raquo; et ce choix sera appliqu&eacute; par d&eacute;faut &agrave; toutes les r&eacute;f&eacute;rences ajout&eacute;es par la suite dans le document. Une fois le style choisi, une fen&ecirc;tre Zotero s&rsquo;ouvre pour choisir la r&eacute;f&eacute;rence &agrave; inclure dans le document. On peut changer en tout temps le style bibliographique de tout le document en cliquant sur <strong>Document Preferences</strong>.</p>
<div class="note">
<p>Ces usages sont décrits plus en détail dans la quatripme partie du tutoriel, intitulée "<a href="https://lausannecitationstyle.github.io/support/4.html">Usage des références</a>".</p>
</div>
        <br>
        <h2>Cas particuliers</h2>
        <p>Certains cas particuliers demandent une compréhension plus avancée des champs composant une notice Zotero ou sont tout simplement trop complexes pour être automatisés entièrement.</p>
        <p><strong>R&eacute;&eacute;dition</strong></p>
<p>Lorsqu&#39;il s&#39;agit d&#39;une r&eacute;&eacute;dition, le style de citation demande d&#39;indiquer la date de la r&eacute;&eacute;dition avec son num&eacute;ro en exposant, ainsi que la date originale entre crochets. Exemple: 1979<sup>4</sup> [1957]</p>
<div class="note"><p>Dans Zotero, indiquer &quot;4&quot; dans le champ &quot;Edition&quot; et &quot;original date: 1957&quot; dans le champ &quot;Extra&quot;.</p></div>
<p><strong>Indications r&eacute;tablies</strong></p>
<p>Alors que les champs vides sont automatiquement indiqu&eacute;s par des [s.l.], [s.n.] ou [s.d.], les indications r&eacute;tablies doivent inclure les crochets carr&eacute;s.&nbsp;</p>
<div class="note"><p>Dans Zotero, indiquer par exemple &quot;[Paris]&quot; dans le champ &quot;Lieu&quot;.</p></div>
<p><strong>Publication s&#39;&eacute;tendant sur plusieurs ann&eacute;es</strong></p>
<p>Reconnaissant et simplifiant automatiquement tout ce qui a la forme d&rsquo;une date dans le champ &quot;ann&eacute;e&quot; (ce qui est tr&egrave;s pratique lorsque le catalogue importe automatiquement &quot;juin 1976&quot; ou &quot;23-07-2003&quot;), Zotero transformera &quot;1973-1978&quot; en &quot;1973&quot;. S&rsquo;il s&rsquo;agit d&rsquo;un ouvrage publi&eacute; en plusieurs volumes sur plusieurs ann&eacute;es, il faut remplacer le trait d&rsquo;union par un tiret bas &quot;_ &quot;. Zotero exportera donc une r&eacute;f&eacute;rence contenant les deux dates :</p>
<p>MICHELET, Jules, <em>Histoire de la R&eacute;volution fran&ccedil;aise</em>, Paris : Chamerot, 1847_1853, 10 vol.</p>
<div class="note"><p>Il suffit ensuite de corriger la r&eacute;f&eacute;rence dans le document en transformant le &quot;_&quot; en &quot;-&quot;.</p></div>
<p><strong>Indication de la collection</strong></p>
<p>Par d&eacute;faut, le style Zotero n&rsquo;affiche pas le nom de la collection, qui peut &ecirc;tre rajout&eacute; &agrave; la main. Ceci est d&ucirc; au fait que seules certaines collections influencent r&eacute;ellement le lecteur, &quot;Rep&egrave;res&quot;, &quot;Que Sais-Je?&quot;, par exemple, alors que les ouvrages sont en g&eacute;n&eacute;ral toujours class&eacute;s dans une collection qui sera import&eacute;e automatiquement et allongerait la r&eacute;f&eacute;rence.</p>
<p><strong>Plusieurs &eacute;diteurs et plusieurs lieux</strong></p>
<p>Le style affiche &quot;[Lieu]:[Editeur]&quot; quel que soit le contenu de ces champs et ne peut pas tenir compte d&rsquo;une situation dans laquelle on trouverait deux &eacute;diteurs situ&eacute;s dans des lieux diff&eacute;rents puisque les lieux seront affich&eacute;s ensemble, ainsi que les &eacute;diteurs (&quot;[Lieu1;Lieu2]:[Editeur1;Editeur2]&quot;) tel que dans cet exemple :</p>
<p>GILMONT, Jean-Fran&ccedil;ois, Le livre &amp; ses secrets, Gen&egrave;ve ; Louvain-la-Neuve : Droz ; Presses universitaires de Louvain, 2003, 440 p.</p>
<div class="note"><p>Il s&rsquo;agit donc de corriger cette r&eacute;f&eacute;rence dans le document/la bibliographie pour r&eacute;tablir l&#39;ordre &quot;[Lieu1]:[Editeur1] ; [Lieu2]:[Editeur2]</p></div>
<p>Une publication ayant plusieurs &eacute;diteurs mais le m&ecirc;me lieu ou &agrave; l&rsquo;inverse un seul &eacute;diteur et plusieurs lieux ne pose pas de probl&egrave;me puisque &quot;[Lieu]:[Editeur1;Editeur2]&quot; ou &quot;[Lieu1;Lieu2]:[Editeur]&quot; (situation fr&eacute;quente) ne cr&eacute;ent pas de malentendu.</p>
      </section>
    </div>
    <script src="javascripts/scale.fix.js"></script>
    
  </body>
</html>
